results/res_3b/test_sglang_multi_rates_20260513_080536_2E_fixed/rate_4.0/results.txt
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='Qwen/Qwen2.5-VL-3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=0.0, image_count=8, image_resolution='640x480', random_image_count=False, image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/test_sglang_multi_rates_20260513_080536/rate_4.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='Qwen/Qwen2.5-VL-3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=0.0, image_count=8, image_resolution='640x480', random_image_count=False, image_format='jpeg', image_content='random', request_rate=4.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/test_sglang_multi_rates_20260513_080536/rate_4.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 103399
#Output tokens: 2196
#Total images: 256
#Images per request: 8 (fixed)

Created 32 random jpeg images with average 2479003 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 32/32 [00:14<00:00,  2.20it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    4.0       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  14.54     
Total input tokens:                      103399    
Total input text tokens:                 2791      
Total input vision tokens:               100608    
Total generated tokens:                  2196      
Total generated tokens (retokenized):    2184      
Request throughput (req/s):              2.20      
Input token throughput (tok/s):          7111.91   
Output token throughput (tok/s):         151.04    
Peak output token throughput (tok/s):    1084.00   
Peak concurrent requests:                31        
Total token throughput (tok/s):          7262.95   
Concurrency:                             21.47     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   9753.65   
Median E2E Latency (ms):                 9670.18   
P90 E2E Latency (ms):                    12702.22  
P99 E2E Latency (ms):                    13547.59  
---------------Time to First Token----------------
Mean TTFT (ms):                          7763.06   
Median TTFT (ms):                        8484.42   
P99 TTFT (ms):                           11447.85  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.94     
Median TPOT (ms):                        4.94      
P99 TPOT (ms):                           141.24    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           29.97     
Median ITL (ms):                         2.93      
P95 ITL (ms):                            7.74      
P99 ITL (ms):                            62.24     
Max ITL (ms):                            6095.52   
==================================================